umami-pantry-api/app/controllers/ingredients_controller.rb

SELECT "ingredients".* FROM "ingredients"
---
  def index
    # Render json (js format used by AJAX lib)
      # convert objects from ORM to JSON and render JSON back to browser
    # ingredients = Ingredient.all
    ingredients = Ingredient.all

SELECT "ingredients".* FROM "ingredients" WHERE "ingredients"."category" = $1  [["category", "Protein Foods"]]
SELECT "ingredients".* FROM "ingredients" WHERE "ingredients"."category" = $1  [["category", "Grains"]]
SELECT 1 AS one FROM "ingredients" WHERE "ingredients"."category" = $1 LIMIT $2  [["category", "Protein Foods"], ["LIMIT", 1]]
---
  def get_ingredients
    category = params[:category].gsub('_', ' ')
    ingredients = Ingredient.where(category: category)
    if ingredients.any?