umami-pantry-api/app/controllers/recipes_controller.rb

SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
---
  def show
    recipe = Recipe.find_by(id: params[:id])