umami-pantry-api/app/services/recipe_serializer.rb

  def to_serialized_json
    # options = {
    #   # include - API to send resource's data along with its associated resources' data
    #   include: {
    #     ingredients: {
    #       only: [:name]
    #     },
    #     recipe_ingredients: {
    #       only: [:ingredient_id, :amounts, :preparation_method]
    #     }
    #   },
    #   except: [:created_at, :updated_at]
    # }

    # return @recipe.to_json(options)

    to_return = []
    @recipe.each do |recipe|
      recipe_hash = recipe.attributes

      recipe_hash["recipe_ingredients"] = []
      recipe.recipe_ingredients.each do |ri|
---
SELECT "recipes".* FROM "recipes"
SELECT "recipe_ingredients".* FROM "recipe_ingredients" WHERE "recipe_ingredients"."recipe_id" = $1  [["recipe_id", 42]]